package com.ecmp.basic.dao;

import com.ecmp.basic.entity.FeatureRole;
import com.ecmp.core.dao.BaseEntityDao;

/**
 * *************************************************************************************************
 * <p/>
 * 实现功能：功能角色数据访问接口
 * <p>
 * ------------------------------------------------------------------------------------------------
 * 版本          变更时间             变更人                     变更原因
 * ------------------------------------------------------------------------------------------------
 * 1.0.00      2017-05-04 13:17      王锦光(wangj)                新建
 * <p/>
 * *************************************************************************************************
 */
public interface FeatureRoleDao extends BaseEntityDao<FeatureRole>, FeatureRoleExtDao {
}
