package com.ecmp.basic.dao;

/**
 * *************************************************************************************************
 * <p/>
 * 实现功能：岗位数据访问扩展接口
 * <p>
 * ------------------------------------------------------------------------------------------------
 * 版本          变更时间             变更人                     变更原因
 * ------------------------------------------------------------------------------------------------
 * 1.0.00      2017/6/30 13:45      秦有宝                     新建
 * <p/>
 * *************************************************************************************************
 */
public interface PositionExtDao {
    /**
     * 检查同一部门下的岗位名称是否存在
     *
     * @param organizationId 组织机构的id
     * @param name 岗位名称
     * @param id 实体id
     * @return 是否存在
     */
    Boolean isOrgAndNameExist(String organizationId, String name, String id);
}
