package com.ecmp.core.entity;

/**
 * <br>
 * *************************************************************************************************<br>
 * <br>
 * 实现功能：<br>
 * 特征接口：租户业务实体接口
 * <br>
 * ------------------------------------------------------------------------------------------------<br>
 * 版本          变更时间             变更人                     变更原因<br>
 * ------------------------------------------------------------------------------------------------<br>
 * 1.0.00      2017/4/21 12:36      马超(Vision.Mac)                新建<br>
 * <br>
 * *************************************************************************************************<br>
 */
public interface ITenant {
    /**
     * 租户代码属性
     */
    String TENANT_CODE = "tenantCode";

    /**
     * @return 租户代码
     */
    String getTenantCode();

    /**
     * 设置租户代码
     *
     * @param tenantCode 租户代码
     */
    void setTenantCode(String tenantCode);
}
