package com.ecmp.edm.entity;

import com.ecmp.annotation.Remark;

/**
 * *************************************************************************************************
 * <p/>
 * 实现功能：文档类型
 * <p>
 * ------------------------------------------------------------------------------------------------
 * 版本          变更时间             变更人                     变更原因
 * ------------------------------------------------------------------------------------------------
 * 1.0.00      2017-07-07 15:12      王锦光(wangj)                新建
 * <p/>
 * *************************************************************************************************
 */
public enum DocumentType {
    //其他文件
    @Remark("其他文件")
    Other,
    //图片
    @Remark("图片")
    Image,
    //PDF文件
    @Remark("PDF文件")
    Pdf,
    //WORD文档
    @Remark("WORD文档")
    Word,
    //电子表格
    @Remark("电子表格")
    Excel,
    //演示文档
    @Remark("演示文档")
    Powerpoint,
    //压缩文件
    @Remark("压缩文件")
    Compressed
}
